# Terraform environment yt01
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_subnet.postgres: Reading...
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Reading...
data.azurerm_user_assigned_identity.admin: Reading...
data.azurerm_subnet.default: Reading...
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_resource_group.spoke: Reading...
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.postgres_server.data.azurerm_client_config.current: Reading...
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.key_vault.data.azurerm_client_config.current: Reading...
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.key_vault.data.azurerm_private_dns_zone.key_vault: Reading...
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01]
module.rbac.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01]
data.azurerm_private_dns_zone.postgres: Reading...
data.azurerm_subnet.postgres: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001yt01/subnets/Postgres]
module.postgres_server.data.azurerm_virtual_network.hub: Reading...
module.key_vault.data.azurerm_private_dns_zone.key_vault: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_client_config.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01]
module.postgres_server.data.azurerm_virtual_network.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
data.azurerm_user_assigned_identity.admin: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001yt01]
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
data.azurerm_subnet.default: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001yt01/subnets/Default]
module.key_vault.data.azurerm_resource_group.key_vault: Reading...
module.appsettings.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_private_dns_zone.postgres: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
module.key_vault.data.azurerm_resource_group.key_vault: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001yt01]
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.OperationalInsights/workspaces/logdwhaltinnauth001yt01]
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001yt01]
module.rbac_platform_app["b367c518-e46e-4dba-bd16-458eb1334163"].data.azurerm_resource_group.hub: Read complete after 2s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 6s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001yt01]
module.rbac_platform_app["14e02a1e-3292-430e-ae4f-855ed40847fd"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 7s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001yt01]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_secret.postgres_app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_app" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001yt01/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001yt01"
      + name                    = "db-psqlsrvaltinnauthregister001yt01-register-app"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.postgres_migration will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_migration" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001yt01/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001yt01"
      + name                    = "db-psqlsrvaltinnauthregister001yt01-register-migrator"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # null_resource.bootstrap_database must be replaced
-/+ resource "null_resource" "bootstrap_database" {
      ~ id       = "7068050680340696526" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "ts" = "2025-03-04T12:27:50Z" -> (known after apply)
        }
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Altinn:Npgsql:register:ConnectionString_yt01-register"] will be created
  + resource "azurerm_app_configuration_key" "key_vault_reference" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Altinn:Npgsql:register:ConnectionString"
      + label                  = "yt01-register"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Altinn:Npgsql:register:Migrate:ConnectionString_yt01-register"] will be created
  + resource "azurerm_app_configuration_key" "key_vault_reference" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Altinn:Npgsql:register:Migrate:ConnectionString"
      + label                  = "yt01-register"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:AppConnectionString_yt01-register"] will be destroyed
  # (because key ["Postgres:AppConnectionString_yt01-register"] is not in for_each map)
  - resource "azurerm_app_configuration_key" "key_vault_reference" {
      - configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub" -> null
      - content_type           = "application/vnd.microsoft.appconfig.keyvaultref+json;charset=utf-8" -> null
      - etag                   = "Quo8B8P7hp0SVqSjy3HXVUpkbg0acCALY8rVxG_d-YE" -> null
      - id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Postgres:AppConnectionString?label=yt01-register" -> null
      - key                    = "Postgres:AppConnectionString" -> null
      - label                  = "yt01-register" -> null
      - locked                 = false -> null
      - tags                   = {} -> null
      - type                   = "vault" -> null
      - value                  = jsonencode(
            {
              - uri = "https://kvregaltinnauth001yt01.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001yt01-register-app"
            }
        ) -> null
      - vault_key_reference    = "https://kvregaltinnauth001yt01.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001yt01-register-app" -> null
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:MigrationConnectionString_yt01-register"] will be destroyed
  # (because key ["Postgres:MigrationConnectionString_yt01-register"] is not in for_each map)
  - resource "azurerm_app_configuration_key" "key_vault_reference" {
      - configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub" -> null
      - content_type           = "application/vnd.microsoft.appconfig.keyvaultref+json;charset=utf-8" -> null
      - etag                   = "WomW3CM1Bl5ITFVYpFQqE1QuH15mPZoEeMY6ykr2bdk" -> null
      - id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Postgres:MigrationConnectionString?label=yt01-register" -> null
      - key                    = "Postgres:MigrationConnectionString" -> null
      - label                  = "yt01-register" -> null
      - locked                 = false -> null
      - tags                   = {} -> null
      - type                   = "vault" -> null
      - value                  = jsonencode(
            {
              - uri = "https://kvregaltinnauth001yt01.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001yt01-register-migrator"
            }
        ) -> null
      - vault_key_reference    = "https://kvregaltinnauth001yt01.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001yt01-register-migrator" -> null
    }

  # module.key_vault.azurerm_private_endpoint.key_vault will be updated in-place
  ~ resource "azurerm_private_endpoint" "key_vault" {
        id                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001yt01/providers/Microsoft.Network/privateEndpoints/pepkvregaltinnauth001yt01"
        name                          = "pepkvregaltinnauth001yt01"
        tags                          = {}
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001yt01/providers/Microsoft.Network/privateEndpoints/pepkvregaltinnauth001yt01/privateDnsZoneGroups/privatelink.vaultcore.azure.net"
            name                 = "privatelink.vaultcore.azure.net"
          ~ private_dns_zone_ids = [
              + "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

        # (1 unchanged block hidden)
    }

  # module.postgres_server.azurerm_management_lock.postgres will be created
  + resource "azurerm_management_lock" "postgres" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "Terraform Managed Lock"
      + notes      = "Prevents unauthorized users from deleting the Postgres server."
      + scope      = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001yt01/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthregister001yt01"
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "postgres_server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001yt01/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthregister001yt01"
        name                              = "psqlsrvaltinnauthregister001yt01"
        tags                              = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgres_server.random_password.pass must be replaced
-/+ resource "random_password" "pass" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "trigger" = "2025-03-04T12:26:44Z" -> (known after apply)
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 5 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @Alxandr |
| Action | `push` |
| Working Directory | `src/apps/Altinn.Register/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/yt01/altinn.register.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_yt01_altinn.register.tfstate.tfplan`